### ðŸ”¸ Q8. Drop Duplicate Rows
Given a DataFrame with repeated rows, remove all duplicates and reset the index.

In [1]:
import pandas as pd
df = pd.DataFrame({
    'Name': ['Ravi', 'Sneha', 'Ravi', 'Isha'],
    'Age': [23, 24, 23, 21]
})

In [4]:
df=df.drop_duplicates()

In [5]:
df.reset_index(drop=True)

    Name  Age
0   Ravi   23
1  Sneha   24
2   Isha   21